app/controllers/constellations_controller.rb

  def index
    @constellations = Constellation.all.order(:id)
---
SELECT "constellations".* FROM "constellations"  ORDER BY "constellations"."id" ASC